mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf56xn/common/mb9bf56xn.h
#define bFM_USB0_HSTATE_CSTAT                     *((volatile  uint8_t *)(0x42842100UL))
#define bFM4_USB0_HSTATE_CSTAT                    *((volatile  uint8_t *)(0x42842100UL))
#define bFM_USB0_HSTATE_TMODE                     *((volatile  uint8_t *)(0x42842104UL))
#define bFM4_USB0_HSTATE_TMODE                    *((volatile  uint8_t *)(0x42842104UL))
#define bFM_USB0_HSTATE_SUSP                      *((volatile  uint8_t *)(0x42842108UL))
#define bFM4_USB0_HSTATE_SUSP                     *((volatile  uint8_t *)(0x42842108UL))
#define bFM_USB0_HSTATE_SOFBUSY                   *((volatile  uint8_t *)(0x4284210CUL))
#define bFM4_USB0_HSTATE_SOFBUSY                  *((volatile  uint8_t *)(0x4284210CUL))
#define bFM_USB0_HSTATE_CLKSEL                    *((volatile  uint8_t *)(0x42842110UL))
#define bFM4_USB0_HSTATE_CLKSEL                   *((volatile  uint8_t *)(0x42842110UL))
#define bFM_USB0_HSTATE_ALIVE                     *((volatile  uint8_t *)(0x42842114UL))
#define bFM4_USB0_HSTATE_ALIVE                    *((volatile  uint8_t *)(0x42842114UL))

#define bFM_USB0_HTOKEN_TGGL                      *((volatile  uint8_t *)(0x4284239CUL))
#define bFM4_USB0_HTOKEN_TGGL                     *((volatile  uint8_t *)(0x4284239CUL))

#define bFM_USB0_UDCC_PWC                         *((volatile  uint8_t *)(0x42842400UL))
#define bFM4_USB0_UDCC_PWC                        *((volatile  uint8_t *)(0x42842400UL))
#define bFM_USB0_UDCC_RFBK                        *((volatile  uint8_t *)(0x42842404UL))
#define bFM4_USB0_UDCC_RFBK                       *((volatile  uint8_t *)(0x42842404UL))
#define bFM_USB0_UDCC_STALCLREN                   *((volatile  uint8_t *)(0x4284240CUL))
#define bFM4_USB0_UDCC_STALCLREN                  *((volatile  uint8_t *)(0x4284240CUL))
#define bFM_USB0_UDCC_USTP                        *((volatile  uint8_t *)(0x42842410UL))
#define bFM4_USB0_UDCC_USTP                       *((volatile  uint8_t *)(0x42842410UL))
#define bFM_USB0_UDCC_HCONX                       *((volatile  uint8_t *)(0x42842414UL))
#define bFM4_USB0_UDCC_HCONX                      *((volatile  uint8_t *)(0x42842414UL))
#define bFM_USB0_UDCC_RESUM                       *((volatile  uint8_t *)(0x42842418UL))
#define bFM4_USB0_UDCC_RESUM                      *((volatile  uint8_t *)(0x42842418UL))
#define bFM_USB0_UDCC_RST                         *((volatile  uint8_t *)(0x4284241CUL))
#define bFM4_USB0_UDCC_RST                        *((volatile  uint8_t *)(0x4284241CUL))

#define bFM_USB0_UDCIE_CONFIE                     *((volatile  uint8_t *)(0x42842820UL))
#define bFM4_USB0_UDCIE_CONFIE                    *((volatile  uint8_t *)(0x42842820UL))
#define bFM_USB0_UDCIE_CONFN                      *((volatile  uint8_t *)(0x42842824UL))
#define bFM4_USB0_UDCIE_CONFN                     *((volatile  uint8_t *)(0x42842824UL))
#define bFM_USB0_UDCIE_WKUPIE                     *((volatile  uint8_t *)(0x42842828UL))
#define bFM4_USB0_UDCIE_WKUPIE                    *((volatile  uint8_t *)(0x42842828UL))
#define bFM_USB0_UDCIE_BRSTIE                     *((volatile  uint8_t *)(0x4284282CUL))
#define bFM4_USB0_UDCIE_BRSTIE                    *((volatile  uint8_t *)(0x4284282CUL))
#define bFM_USB0_UDCIE_SOFIE                      *((volatile  uint8_t *)(0x42842830UL))
#define bFM4_USB0_UDCIE_SOFIE                     *((volatile  uint8_t *)(0x42842830UL))
#define bFM_USB0_UDCIE_SUSPIE                     *((volatile  uint8_t *)(0x42842834UL))
#define bFM4_USB0_UDCIE_SUSPIE                    *((volatile  uint8_t *)(0x42842834UL))

#define bFM_USB0_UDCS_CONF                        *((volatile  uint8_t *)(0x42842800UL))
#define bFM4_USB0_UDCS_CONF                       *((volatile  uint8_t *)(0x42842800UL))
#define bFM_USB0_UDCS_SETP                        *((volatile  uint8_t *)(0x42842804UL))
#define bFM4_USB0_UDCS_SETP                       *((volatile  uint8_t *)(0x42842804UL))
#define bFM_USB0_UDCS_WKUP                        *((volatile  uint8_t *)(0x42842808UL))
#define bFM4_USB0_UDCS_WKUP                       *((volatile  uint8_t *)(0x42842808UL))
#define bFM_USB0_UDCS_BRST                        *((volatile  uint8_t *)(0x4284280CUL))
#define bFM4_USB0_UDCS_BRST                       *((volatile  uint8_t *)(0x4284280CUL))
#define bFM_USB0_UDCS_SOF                         *((volatile  uint8_t *)(0x42842810UL))
#define bFM4_USB0_UDCS_SOF                        *((volatile  uint8_t *)(0x42842810UL))
#define bFM_USB0_UDCS_SUSP                        *((volatile  uint8_t *)(0x42842814UL))
#define bFM4_USB0_UDCS_SUSP                       *((volatile  uint8_t *)(0x42842814UL))


/*******************************************************************************
* USBCLK Registers USBCLK
*   Bitband Section
*******************************************************************************/
#define bFM_USBCLK_UCCR_UCEN0                     *((volatile  uint8_t *)(0x426C0000UL))
#define bFM4_USBCLK_UCCR_UCEN0                    *((volatile  uint8_t *)(0x426C0000UL))
#define bFM_USBCLK_UCCR_UCSEL                     *((volatile  uint8_t *)(0x426C0004UL))
#define bFM4_USBCLK_UCCR_UCSEL                    *((volatile  uint8_t *)(0x426C0004UL))
#define bFM_USBCLK_UCCR_UCEN1                     *((volatile  uint8_t *)(0x426C000CUL))
#define bFM4_USBCLK_UCCR_UCEN1                    *((volatile  uint8_t *)(0x426C000CUL))

#define bFM_USBCLK_UP_STR_UPRDY                   *((volatile  uint8_t *)(0x426C0280UL))
#define bFM4_USBCLK_UP_STR_UPRDY                  *((volatile  uint8_t *)(0x426C0280UL))

#define bFM_USBCLK_UPCR1_UPLLEN                   *((volatile  uint8_t *)(0x426C0080UL))
#define bFM4_USBCLK_UPCR1_UPLLEN                  *((volatile  uint8_t *)(0x426C0080UL))
#define bFM_USBCLK_UPCR1_UPINC                    *((volatile  uint8_t *)(0x426C0084UL))
#define bFM4_USBCLK_UPCR1_UPINC                   *((volatile  uint8_t *)(0x426C0084UL))

#define bFM_USBCLK_UPINT_CLR_UPCSC                *((volatile  uint8_t *)(0x426C0380UL))
#define bFM4_USBCLK_UPINT_CLR_UPCSC               *((volatile  uint8_t *)(0x426C0380UL))

#define bFM_USBCLK_UPINT_ENR_UPCSE                *((volatile  uint8_t *)(0x426C0300UL))
#define bFM4_USBCLK_UPINT_ENR_UPCSE               *((volatile  uint8_t *)(0x426C0300UL))

#define bFM_USBCLK_UPINT_STR_UPCSI                *((volatile  uint8_t *)(0x426C0400UL))
#define bFM4_USBCLK_UPINT_STR_UPCSI               *((volatile  uint8_t *)(0x426C0400UL))

#define bFM_USBCLK_USBEN0_USBEN0                  *((volatile  uint8_t *)(0x426C0600UL))
#define bFM4_USBCLK_USBEN0_USBEN0                 *((volatile  uint8_t *)(0x426C0600UL))

#define bFM_USBCLK_USBEN1_USBEN1                  *((volatile  uint8_t *)(0x426C0680UL))
#define bFM4_USBCLK_USBEN1_USBEN1                 *((volatile  uint8_t *)(0x426C0680UL))


